{
  "accordion": {
    "title": "Accordion — How to Play",
    "lines": [
      "Goal: Finish with piles at or below the difficulty target once the stock is empty.",
      "Setup: A shuffled 52-card stock sits at the upper left. Click it to deal face-up cards in rows of seven, wrapping left to start each new row.",
      "Layout: Each dealt card becomes its own pile. When a new row starts, the first card is considered adjacent to the final column of the previous row.",
      "Moves: Drag the top pile one space to the left when the top cards match in rank or suit. You may also jump three piles to the left with the same match rule.",
      "Dragging carries the entire pile with the top card. There is no need to fan the cards in a pile.",
      "Dealing: You may deal a new card at any time until the stock is empty. On Normal and Hard, dealing disables undo until another move is made.",
      "Win: Stock empty and no moves left with 7 (Easy), 4 (Normal), or 1 (Hard) piles remaining. Otherwise the game is a loss.",
      "Toolbar: Menu, New game, Undo, Save&Exit, and Help.",
      "Options: Pick Easy, Normal, or Hard from the options dialog or resume a saved deal with your last difficulty setting."
    ]
  },
  "big_ben": {
    "title": "Big Ben - How to Play",
    "lines": [
      "Goal: Build each foundation to its clock value using cards of the same suit.",
      "Setup: One copy of the highlighted cards forms the twelve foundations arranged like a clock (starting at the 9 o'clock position).",
      "Tableau: Each foundation has an outward fan of up to three face-up cards. The outermost card of a fan is the only card that may move.",
      "Tableau moves: Move a fan's top card onto another fan when it is exactly one rank lower (wrapping K->A) and the same suit.",
      "Foundations: Build upward by suit from the starting card, wrapping K->A, until the foundation's clock rank is on top. Waste cards may also be played here.",
      "Stock: Click the stock to refill every fan with fewer than three cards (starting at 12 o'clock clockwise). If no fan needs cards, the click moves the top stock card to the waste face-up.",
      "Waste: Its top card can only be played to foundations. It never refills tableau fans.",
      "End: Win when all foundations reach their clock rank. Lose when the stock is empty and there are no legal moves left.",
      "Toolbar: Menu (return to Big Ben menu), New deal, Restart, Undo, Help, Save&Exit.",
      "Options: Big Ben uses a single ruleset; the options dialog simply lets you resume an unfinished clock or start a new one."
    ],
    "max_width": 880
  },
  "british_square": {
    "title": "British Square — How to Play",
    "lines": [
      "Goal: Build each suited foundation from Ace up to King, place the second King on top, then build back down to Ace.",
      "Setup: Two standard decks are shuffled together. Four rows of four face-up cards form the tableau. Remaining cards become the face-down stock; the waste starts empty.",
      "Layout: Tableau piles form a centred 4×4 grid. A single column of foundations — Spades, Hearts, Diamonds, Clubs — sits one card-width to the right. Stock and waste piles rest to the left.",
      "Moves to foundations: Drag or double-click any exposed tableau or waste top card that matches the next rank required for its suited foundation (A→K, the second K, then K→A).",
      "Tableau building: Move one card at a time between tableau piles when it matches suit and is exactly one rank above or below the destination top card. The first move sets that pile's build direction until the pile is emptied.",
      "Empty tableau piles immediately refill from the waste top card when available; otherwise draw the next stock card (turned face-up) to fill the vacancy.",
      "Stock & waste: Click the stock to deal one card face-up to the waste. Waste cards may play to tableau piles (respecting suit/direction) or foundations.",
      "Controls: The toolbar provides New, Restart, Undo, Hint, Auto (once stock and waste are empty), Help, and Save & Exit. Dragging near edges pans the table when layouts exceed the screen.",
      "End: Win when all four foundations complete both ascending and descending sequences. If the stock and waste are empty and no tableau moves remain, the game is lost.",
      "Options: British Square has fixed rules; the options screen only offers resume/start controls."
    ],
    "max_width": 900
  },
  "beleaguered_castle": {
    "title": "Beleaguered Castle - How to Play",
    "lines": [
      "Goal: Build each foundation from Ace to King in the same suit.",
      "Setup: All four aces start on the central foundations. The remaining 48 cards are dealt face-up into eight rows of six cards that flank each foundation (left and right).",
      "Moves: You may move only the exposed bottom card of any row. Place it onto another row when its rank is exactly one less than the target card, regardless of suit. Empty rows may be filled by any single card.",
      "Foundations: When a top card is the next rank for its suited foundation, double-click it (or drag it) to build upward. Foundations build A->K and cannot move back to the tableau.",
      "Controls: Toolbar buttons provide New Deal, Restart, Undo, Auto-complete, Help, Save & Exit, and return to the menu. Auto-complete becomes available when every tableau row is already in perfect descending order.",
      "Options: Beleaguered Castle offers no variants—the options dialog only resumes a saved layout or deals a fresh one."
    ],
    "max_width": 860
  },
  "freecell": {
    "title": "FreeCell — How to Play",
    "lines": [
      "Goal: Move all cards to the four foundations, building each A→K by suit.",
      "Setup: A 52-card deck deals face-up into eight tableau columns; the first four receive seven cards, the last four receive six.",
      "Layout: Four single-slot free cells sit to the left of the foundations. Any face-up card may occupy a free cell.",
      "Tableau building: Build downward by rank while alternating colors. Only ordered alternating runs may move between columns.",
      "Moving stacks: The longest run you can drag equals (empty tableau columns + 1) × (empty free cells + 1). Empty columns accept any card or legal run.",
      "Foundations: Double-click or drag eligible cards to build up in suit. The Auto button sends all safe cards home once no further tableau play is lost.",
      "Undo and Restart are always available for corrections or to replay the current deal from its initial layout.",
      "Options: FreeCell has a single ruleset; the options dialog lets you resume a saved deal or start a fresh random deal."
    ]
  },
  "gate": {
    "title": "Gate — How to Play",
    "lines": [
      "Goal: Build all four foundations A→K by suit before you run out of moves.",
      "Setup: Deal one face-up card to each of the eight center tableau piles (arranged in two rows). Each side reserve receives five face-up cards stacked vertically; the remaining deck forms the face-down stock above the waste.",
      "Layout: Foundations sit above the center grid with fixed suits (Spades, Hearts, Diamonds, Clubs). Stock and waste share the left edge, while the reserves flank the tableau on both sides.",
      "Tableau play: Move only the top card of a center pile, placing it on another center pile when it is one rank lower and opposite in color. Empty centers normally refill themselves—you cannot directly place a card onto a gap while stock or waste remain.",
      "Reserves: The exposed card from either reserve may move to a foundation or to a center pile. When a center pile empties it automatically draws from the nearest reserve; if both reserves are empty it pulls from the waste, then the stock (aces leap straight to foundations).",
      "Stock & waste: Click the stock to draw one card face-up to the waste. There are no redeals. Waste top cards may play to the center grid or foundations if they meet the usual requirements.",
      "Manual fills: Once both stock and waste are empty you may drag a reserve top card onto an empty center space to keep the game moving.",
      "Toolbar: New Deal, Restart, Undo, Auto-finish, Help, and Save & Exit buttons are available at all times.",
      "Options: Gate offers no variant toggles; the options dialog simply lets you resume a saved game or begin a new one."
    ]
  },
  "chameleon": {
    "title": "Chameleon — How to Play",
    "lines": [
      "Goal: Build each foundation by suit starting from the starter card and wrapping K→A.",
      "Setup: Deal 12 face-up cards to the reserve at the upper left, then flip the next card to start the first foundation and set the base rank.",
      "Tableau: Three columns beneath the foundations build down by 1 regardless of suit, wrapping A→K, and may move in complete descending sequences.",
      "Reserve: Only the top card may be played. Empty tableau columns auto-fill from the reserve, then from the waste if the reserve is empty.",
      "Stock/Waste: Click the stock to deal one card face-up to the waste. When the stock is empty, turn the waste over to form a new stock until redeals run out.",
      "Moves: Drag single cards or valid descending sequences between tableau columns, or play any eligible card to its foundation.",
      "Toolbar: Menu, New game, Restart, Undo, Save&Exit, and Help.",
      "Options: Set the number of allowed redeals (Unlimited, None, or 1) from the options dialog; resumes honor the chosen limit."
    ],
    "max_width": 880
  },
  "demon": {
    "title": "Demon (Canfield) — How to Play",
    "lines": [
      "Goal: Build each foundation by suit starting from the starter card and wrapping K→A.",
      "Setup: Deal 13 face-up cards to the Demon reserve at the upper left, then flip the next card to start the first foundation and set the base rank.",
      "Tableau: Four face-up columns beneath the foundations build down by 1 with alternating colors, wrapping A→K.",
      "Reserve: Only the top card of the Demon may be played. Empty tableau columns auto-fill from the reserve, then from the waste if the reserve is empty.",
      "Stock/Waste: Click the stock to deal up to three cards face-up to the waste. When the stock is empty, turn the waste over to form a new stock until replays run out.",
      "Moves: Drag single cards or ordered alternating sequences between tableau columns, or play any eligible card to its foundation.",
      "Toolbar: Menu, New game, Restart, Undo, Save&Exit, and Help.",
      "Options: Choose how many stock replays are allowed (Unlimited, 3, or 1) in the options dialog or resume a saved deal with that limit."
    ],
    "max_width": 880
  },
  "duchess": {
    "title": "Duchess — How to Play",
    "lines": [
      "Goal: Build each foundation by suit starting from the chosen base rank, wrapping K→A.",
      "Setup: Deal four horizontal reserve fans of 4/3/3/3 cards above the foundations, and one face-up card to each tableau column.",
      "Starter: Choose one reserve top card to begin the first foundation and define the base rank; the remaining foundations follow suit order.",
      "Tableau: Four face-up columns beneath the foundations build down by 1 with alternating colors, wrapping A→K, and may move in complete alternating sequences.",
      "Reserve: Only the top card of each reserve fan may be played. Empty tableau columns auto-fill from the reserves, then the waste, then the stock if available.",
      "Stock/Waste: Click the stock to deal one card face-up to the waste. When empty, turn the waste over once to form a new stock.",
      "Moves: Drag single cards or valid descending alternating sequences between tableau columns, or play any eligible card to its foundation.",
      "Toolbar: Menu, New game, Restart, Undo, Save&Exit, and Help.",
      "Options: Duchess follows a single ruleset; use the options dialog to resume a saved deal or start a new one."
    ],
    "max_width": 880
  },
  "golf": {
    "title": "Golf — How to Play",
    "lines": [
      "Goal: Complete the chosen 1-, 3-, 9-, or 18-hole course with the lowest total score.",
      "Setup: Seven tableau columns each receive five face-up cards. The remaining deck sits face-down as a stock; the waste/foundation pile starts empty until you flip the first stock card.",
      "Play: Only the top card of each tableau pile is active. Move it to the foundation when its rank is exactly one higher or lower than the foundation top, regardless of suit.",
      "Around the Corner: When this option is on, Aces and Kings are adjacent; when off, sequences stop at the ends.",
      "Stock: Flip one card at a time to the foundation whenever you need a new starting rank. There are no redeals within a hole.",
      "Scoring: Clearing every tableau card scores the negative of the cards still in stock; otherwise you score the number of cards left in the tableau. Course score is the sum of hole scores, with par targets shown on the scorecard.",
      "Between holes: Once a hole ends, the next begins automatically with the current Around/Length settings. Use Save&Exit to preserve your multi-hole progress and resume later.",
      "Toolbar: New Game (reset course), Restart Hole, Undo, Help, and Save&Exit are always available.",
      "Options: Course Length chooses 1, 3, 9, or 18 holes; Around the Corner toggles whether ranks wrap A↔K. Access the Scores button from the options dialog to review past rounds."
    ]
  },
  "monte_carlo": {
    "title": "Monte Carlo — How to Play",
    "lines": [
      "Goal: Remove every card from the tableau and stock by discarding touching pairs of equal rank.",
      "Setup: Deal a 5×5 grid of face-up cards. The remaining cards form a face-down stock with a pairs pile beneath it to collect discards.",
      "Selecting cards: Choose any two orthogonally or diagonally adjacent cards of the same rank. Matched cards slide to the pairs pile and leave gaps in the grid.",
      "Compacting: Whenever spaces appear, click Compact (or tap the stock) to squeeze cards left within each row, then slide rows upward, repeating until the tableau packs tightly.",
      "Refilling: After a compact, empty cells fill from the stock in reading order (left-to-right, top-to-bottom). When the stock runs out, further compacts only slide the remaining grid.",
      "End of game: You win once both tableau and stock are empty. You lose when no adjacent matches remain and the stock cannot refill gaps.",
      "Options: Monte Carlo uses a single ruleset; the options dialog only allows resuming a saved game or starting anew.",
      "Toolbar: Menu, New Game, Restart, Compact, Save&Exit, and Help buttons remain available during play."
    ]
  },
  "klondike": {
    "title": "Klondike — How to Play",
    "lines": [
      "Goal: Build four foundations from Ace to King in each suit.",
      "Setup: Seven tableau piles run left to right with 1–7 cards; only the top card of each pile begins face-up. The remaining deck forms a face-down stock with a waste pile beside it.",
      "Tableau play: Build down by rank while alternating colors. You may drag an ordered run of alternating colors between columns, revealing facedown cards as they become exposed.",
      "Empty columns: Only a King (or a properly ordered run headed by a King) may occupy an empty tableau space.",
      "Foundations: Double-click or drag eligible cards to build upward by suit from Ace to King. The Auto button finishes once all moves to foundations are safe.",
      "Stock & waste: Click the stock to turn cards face-up onto the waste in packets of 1 or 3 depending on the Draw Mode option. Play the waste top back to the tableau or straight to a foundation.",
      "Redeals: The Stock Cycles option controls how many times you may recycle the waste onto the stock—Unlimited, 2 cycles, or 1 cycle for hard mode.",
      "Controls: Toolbar buttons include New Game, Restart, Undo, Hint, Auto, Help, and Save & Exit.",
      "Options: Choose Draw 1 or Draw 3 and set allowed stock cycles from the options dialog; you can also resume a saved deal from there."
    ]
  },
  "pyramid": {
    "title": "Pyramid — How to Play",
    "lines": [
      "Goal: Clear the pyramid by removing cards in combinations that total 13.",
      "Setup: Build a seven-row pyramid of 28 face-up cards. The remaining cards form a face-down stock above two waste piles positioned beneath it.",
      "Available cards: Only uncovered pyramid cards (those without cards resting on them) and the top cards of either waste pile may be played.",
      "Matching: Combine two available cards whose ranks sum to 13—Jacks count 11, Queens 12, Kings 13. Kings remove on their own.",
      "Stock & waste: Clicking the stock deals one card face-up to the left waste. If a card was already there, it slides to the right waste so you can still pair it later.",
      "Resets: When the stock is empty you may recycle the right waste into a new stock, turning the cards face-down in order. The Resets option determines how many redeals remain (Unlimited, 2, or 1).",
      "End of game: Win by clearing every pyramid card. If no legal pairs exist and you are out of resets, the game ends in a loss.",
      "Toolbar: New Game, Restart, Undo, Hint, Help, and Save&Exit controls remain available throughout play.",
      "Options: Choose the number of allowed stock resets from the options dialog or resume an unfinished game from there."
    ]
  },
  "tripeaks": {
    "title": "TriPeaks — How to Play",
    "lines": [
      "Goal: Clear every tableau card by playing them to the waste pile in sequence.",
      "Setup: The tableau forms three overlapping peaks. Ten cards make the base row, nine sit above it, then six, then three at the top. Only the bottom row starts face-up.",
      "Available cards: A tableau card becomes playable when nothing covers it. Move a playable card to the waste when its rank is exactly one higher or lower than the current waste top, regardless of suit.",
      "Wrap option: If Wrap A↔K is enabled, Aces and Kings count as adjacent; when off, runs stop at Ace and King.",
      "Stock: The first stock card automatically flips to start the waste. When no moves remain, click the stock to deal the next card. There are no redeals once the stock empties.",
      "Scoring & finish: You win by clearing the tableau before the stock runs out. Hint highlights a playable card; Undo and Restart retrace or replay the current deal.",
      "Toolbar: New Game, Restart, Undo, Hint, Help, and Save&Exit are available at any time.",
      "Options: Toggle Wrap A↔K from the options dialog or resume a saved game from there."
    ]
  },
  "yukon": {
    "title": "Yukon — How to Play",
    "lines": [
      "Goal: Build four foundations from Ace to King in each suit.",
      "Setup: Seven tableau piles sit left of the foundations. From left to right they contain 1, 6, 7, 8, 9, 10, and 11 cards; only the top five cards of each multi-card pile start face-up. There is no stock or waste.",
      "Tableau play: You may drag any group of face-up cards together—even if the sequence is broken—as long as the bottom card is one rank lower and the opposite color of the destination top card.",
      "Empty columns: Only a King or a stack headed by a King may occupy an empty tableau column.",
      "Foundations: Build upward by suit from Ace to King. Newly uncovered aces jump to their foundations automatically, and double-clicking moves other eligible top cards.",
      "Progress: Reveal facedown cards by moving the piles above them. Once every tableau card is face-up you can trigger Auto to finish the game.",
      "Toolbar: New Deal, Restart, Undo, Auto, Help, and Save&Exit remain available while you play.",
      "Options: Yukon has a single ruleset; the options dialog offers resume/start controls without additional variants."
    ]
  },
  "bowling_solitaire": {
    "title": "Bowling Solitaire — How to Play",
    "lines": [
      "Goal: Play 10 frames of bowling using card-matching shots and score like ten-pin bowling.",
      "Setup: Aces through Tens of hearts and spades are shuffled. Ten cards form an upside-down triangle of pins.",
      "The remaining cards become three ball piles (sizes 5/3/2). Top cards of each pile are face-up for the current ball.",
      "Shot: Select a face-up ball card then choose 1, 2, or 3 adjacent pins. A single pin must match the card rank.",
      "For combos, the ones digit of the pin total must match the ball card's ones digit. Removed pins go to the gutter.",
      "First-ball restrictions: back row pins can't be the very first knock-down, and the middle pin must be part of a combo.",
      "Second (and third) balls require every picked pin to touch at least one pin knocked down on the prior ball, unless pins reset.",
      "A ball ends when you clear all pins, discard a ball card, or no moves remain. Strike/spare scoring follows bowling rules.",
      "Tenth frame: strikes or spares earn extra balls. Pins reset between bonus balls when a rack is cleared.",
      "Toolbar: Menu, New game, Save&Exit, Help. Action buttons handle Knock Down, Discard Ball, and clearing your selection.",
      "Options: Bowling Solitaire has a single rule set; open the options dialog to resume a saved series or start a new game."
    ],
    "max_width": 880
  }
}
